// //-------------------------------//

// let str = "Saitama"
// str = str.length - 3
// console.log(str); //Свойство length представляет длину строки.

// //-------------------------------//

// let str = "sabachka.gmail.com"
// str = str.indexOf('.'), str.length
// console.log(str); //Метод indexOf() возвращает индекс первого вхождения указанного значения в строковый объект String

// //-------------------------------//

// let str = "sabachka.gmail.com"
// str = str.lastIndexOf('.')
// console.log(str); //Метод lastIndexOf() возвращает индекс последнего вхождения указанного значения в строковый объект String, на котором он был вызван

// //-------------------------------//

// let str = "hello world"
// str = str.charAt(6)
// console.log(str); //Метод charAt() возвращает указанный символ из строки. Нужно использовать индекс символа

// //-------------------------------//

// let num = Math.floor(1.546)
// console.log(num); //Возвращает значение числа, округлённое к меньшему целому.

// //-------------------------------//

// let num = Math.round(1.568)
// console.log(num); //Возвращает значение числа, округлённое до ближайшего целого.

// //-------------------------------//

// let num = Math.random()
// console.log(num);

// //-------------------------------//

// let num = Math.ceil(1.2)
// console.log(num); //Возвращает значение числа, округлённое к большему целому.

// //-------------------------------//

// let num = Math.pow(2,7)
// console.log(num); //Возвращает a в n-й степени.

// //-------------------------------//





























































































// let Masiv = [
//     {
//         name: "Saidbek",
//         age: 13,

//     }, {
//         name: "Odik",
//         age: 13,

//     }, {
//         name: "Pasha",
//         age: 32,

//     }, {
//         name: "Alisher",
//         age: 42,

//     },
// ]

// //-------------------------------//

// let find_el = Masiv.find(item => item.name == "Saidbek")
// console.log(find_el);

// //-------------------------------//

// let filt = Masiv.filter(item => item.age >= 20)
// console.log(filt);

// //-------------------------------//

// let new_arr2 = Masiv.map(item => item.age + 200)
// console.log(new_arr2);

// //-------------------------------//



// //-------------------------------//

// let users = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12]

// //-------------------------------//

// users = users.sort((a, b) => a - b)
// console.log(users); //Метод sort() на месте сортирует элементы массива и возвращает отсортированный массив.

// //-------------------------------//

// let user2 = users.map(item => item - 2)
// console.log(user2); //Метод map() создаёт новый массив с результатом вызова указанной функции для каждого элемента массива.

// //-------------------------------//

// let user3 = users.some(item => item == 2)
// console.log(user3); //Метод some() проверяет, удовлетворяет ли какой-либо элемент массива условию, заданному в передаваемой функции.

// //-------------------------------//

// user3 = users.every(item => item == 2)
// console.log(user3);

// //-------------------------------//

// users.forEach(item => {
//     item = users + 2
// })
// console.log(users); //Метод forEach() выполняет указанную функцию один раз для каждого элемента в массиве.'

// //-------------------------------//

// const array1 = [1, 2, 3];
// console.log(array1.includes(2)); //Метод includes() определяет, содержит ли массив определённый элемент, возвращая в зависимости от этого true или false.

// //-------------------------------//

// const pets = ['cat', 'dog', 'bat'];
// console.log(pets.includes('cat')); //Метод includes() определяет, содержит ли массив определённый элемент, возвращая в зависимости от этого true или false.
// console.log(pets.includes('at'));

// //-------------------------------//

// var arr1 = [1, 2, [3, 4]];
// arr1 = arr1.flat(); //Убирает подмассив, уберет столь сколько указанов скобках
// console.log(arr1);

// //-------------------------------//

// var arr2 = [1, 2, [3, 4, [5, 6]]];
// arr2 = arr2.flat();
// console.log(arr2);

// //-------------------------------//

// var arr3 = [1, 2, [3, 4, [5, 6]]];
// arr3 = arr3.flat(2);
// console.log(arr3);

// //-------------------------------//

// var arr4 = [1, 2, [3, 4, [5, 6, [7, 8, [9, 10]]]]];
// arr4 = arr4.flat(Infinity); //Значение Infinity уберет все подмассивы
// console.log(arr4);

// //-------------------------------//




